{
  "name": "Ryze",
  "id": "38",
  "type": [
    "Wanderer, Invoker"
  ],
  "spell_desc": "Wanderers spells change depending on the Region Portal players voted for at the start of the game.<br tooltip-break=true>\nBandle City\nRyze creates a portal to Bandle City underneath a random unit on your bench. After a brief delay, they arrive on the battlefield with bonus mana and are...slightly smaller?\n\nDemacia\nRyze creates a portal to Demacia underneath a cluster of injured allies, granting Shield for 2 seconds. If an ally leaves the safety of the portal, they are healed for Health. When the portal expires, enemies within are dealt magic damage.\n\nFreljord\nRyze creates a portal to the Freljord underneath a random group of enemies for 3 seconds. The freezing winds deal magic damage to enemies within two hexes over the duration and apply Permafrost, a permanent Chill.\nIf enemies are already affected by Permafrost, they are instead Stunned for the duration.\nChill: Reduce Attack Speed by 30%\n\nIonia\nRyze creates a portal to Ionia, summoning forth a Spirit Tree that affects the closest units. Allies are invigorated, gaining Attack Speed for 6 seconds and restoring Health over the duration. Enemies are pacified, causing them to dance.\n\nNoxus\nRyze creates a portal to Noxus armory that spews out a torrent of weapons and armor, granting completed items to random allies with open slots, and throwing Axes towards random enemies that deal magic damage each.\nIf any ally would recieve an item while all slots are full, they instead gain a stacking 40% damage increase for the rest of combat.\n\nPiltover\nRyze summons a portal to Piltover that launches out an enforcer grenade towards his target, dealing magic damage to enemies within two hexes and creating a containment area for seconds. Enemies are unable to leave the area, and of the damage dealt to them is also dealt to all other enemies within.\n\nShadow Isles\nRyze creates a portal to the Shadow Isles, reclaiming lost allys souls. They return to the battlefield, with % of their maximum Health.\nIf no allies have died yet, the portal remains open, waiting for an ally to die. Ryze cannot resurrect himself.\n\nShurima\nRyze creates a portal to Shurima, summoning a gigantic sand tornado that travels across the battlefield, dealing magic damage to enemies hit and knocking them up briefly.\nThe tornado has chance to unearthed burried treasures and gold as it travels.\n\nTargon\nRyze creates a portal to the skies above Mount Targon that beckons his target. After a few seconds, they descend from the heavens as a meteor towards the largest cluster of enemies, dealing % of the the initial targets maximum Health as magic damage and knocking up enemies in the epicenter.\n\nZaun\nOpen portals to Zuan, causing hired guns to fire a torrent of munitions at a nearby enemy that deal magic damage and apply 50% Wound, 40% Shred, and 40% Sunder for 6 seconds. The more gold you have, the more power the portals become.\n25 Gold: +1 Portal. Portals fire a rocket that deals 50% damage in a one-hex radius\n50 Gold: Double the portals. Summon +2 additional portals for every 15 Gold more.",
  "spell": [
    {
      "key": "",
      "stats": [
        ""
      ]
    }
  ],
  "health": [
    1111,
    2000,
    3600
  ],
  "armor": [
    30
  ],
  "resistance": [
    30
  ],
  "mana_start": "0",
  "mana_cost": "99",
  "ap": "100",
  "attack": [
    50,
    75,
    113
  ],
  "speed": "0.85"
}
